// Напишите программу, которая на фход принимает число и выдаёт 
// его квадрат (число умноженное само на себя)
// например:
// 4 --> 16
// 3 --> 9

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());

Console.WriteLine(number * number);
